Австралия/src/Documents/Transformation/Transformation.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Transformation</name>
  <registerRecords>AccountingRegister.AccountingJournalEntries</registerRecords>
  <registerRecords>InformationRegister.DocumentAccountingEntriesStatuses</registerRecords>
  <registerRecords>AccountingRegister.FinancialJournalEntries</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>TransformationTemplate</name>
    <type>
      <types>CatalogRef.TransformationTemplates</types>
    </type>
  </attributes>
  <attributes>
    <name>OriginalDocument</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>TransformationMethod</name>
    <type>
      <types>EnumRef.TransformationMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>Author</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>PostingDateFromDocument</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ChartOfAccounts</name>
    <type>
      <types>CatalogRef.MetadataObjectIDs</types>
    </type>
  </attributes>
  <attributes>
    <name>ChartOfAccountsSource</name>
    <type>
      <types>CatalogRef.MetadataObjectIDs</types>
    </type>
  </attributes>
  <attributes>
    <name>AccountingRegister</name>
    <type>
      <types>CatalogRef.MetadataObjectIDs</types>
    </type>
  </attributes>
  <attributes>
    <name>AccountingRegisterSource</name>
    <type>
      <types>CatalogRef.MetadataObjectIDs</types>
    </type>
  </attributes>
  <attributes>
    <name>StartDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EndDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Postings</name>
    <attributes>
      <name>Debit</name>
      <type>
        <types>ChartOfAccountsRef</types>
      </type>
    </attributes>
    <attributes>
      <name>DebitSource</name>
      <type>
        <types>ChartOfAccountsRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Credit</name>
      <type>
        <types>ChartOfAccountsRef</types>
      </type>
    </attributes>
    <attributes>
      <name>CreditSource</name>
      <type>
        <types>ChartOfAccountsRef</types>
      </type>
    </attributes>
    <attributes>
      <name>PostingDate</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Content</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Австралия/src/Documents/Transformation/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Public

// Initializes the tables of values that contain the data of the document table sections.
// Saves the tables of values in the properties of the structure "AdditionalProperties".
//
Procedure InitializeDocumentData(DocumentRefTransformation, StructureAdditionalProperties) Export
	
	Query = New Query;
	
	Query.TempTablesManager = StructureAdditionalProperties.ForPosting.StructureTemporaryTables.TempTablesManager;
	
	Query.SetParameter("Ref", DocumentRefTransformation);
	Query.SetParameter("Company", StructureAdditionalProperties.ForPosting.Company);
	
	Query.Text =
	"SELECT
	|	Transformation.Date AS Date,
	|	&Company AS Company,
	|	Transformation.PostingDateFromDocument AS PostingDateFromDocument,
	|	Transformation.Ref AS Ref
	|INTO TransformationTable
	|FROM
	|	Document.Transformation AS Transformation
	|WHERE
	|	Transformation.Ref = &Ref
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	CASE
	|		WHEN TransformationTable.PostingDateFromDocument
	|			THEN TransformationTable.Date
	|		ELSE TransformationPostings.PostingDate
	|	END AS Period,
	|	TransformationTable.Company AS Company,
	|	VALUE(Catalog.PlanningPeriods.Actual) AS PlanningPeriod,
	|	TransformationPostings.Debit AS AccountDr,
	|	UNDEFINED AS CurrencyDr,
	|	0 AS AmountCurDr,
	|	TransformationPostings.Credit AS AccountCr,
	|	UNDEFINED AS CurrencyCr,
	|	0 AS AmountCurCr,
	|	TransformationPostings.Amount AS Amount,
	|	TransformationPostings.Content AS Content,
	|	FALSE AS OfflineRecord
	|FROM
	|	Document.Transformation.Postings AS TransformationPostings
	|		INNER JOIN TransformationTable AS TransformationTable
	|		ON TransformationPostings.Ref = TransformationTable.Ref";
	
	QueryResult = Query.Execute();
	
	AccountingRegister = Common.ObjectAttributeValue(DocumentRefTransformation, "AccountingRegister");
	
	StructureAdditionalProperties.TableForRegisterRecords.Insert("TableJournalEntries", QueryResult.Unload());
	StructureAdditionalProperties.ForPosting.Insert("AccountingRegisterName", AccountingRegister.Name);
	
	FinancialAccounting.FillExtraDimensions(DocumentRefTransformation, StructureAdditionalProperties);
	
EndProcedure

#Region ObjectVersioning

// StandardSubsystems.ObjectVersioning

Procedure OnDefineObjectVersioningSettings(Settings) Export

EndProcedure

// End StandardSubsystems.ObjectVersioning

#EndRegion

#EndRegion

#EndIf
